---
type: SlabShapeVertexArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# SlabShapeVertexArray

`Autodesk.Revit.DB.SlabShapeVertexArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SlabShapeVertexArray | — | `public SlabShapeVertexArray ()` |
| Method | Append | — | `public virtual void Append ( SlabShapeVertex item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual SlabShapeVertexArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( SlabShapeVertex item , int index )` |
| Method | ReverseIterator | — | `public virtual SlabShapeVertexArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual SlabShapeVertex this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |